// Запрос баланса (баланс)
export const currency_rx = /.*[б][а|][о|л][а][н][с].*|.*[б][а|][д|л][а][н][с].*|.*[б][а|][л][в|а][н][с].*|.*[б][а|][л][п|а][н][с].*|.*[б][а|][л][а][н][с].*/gi
    // Курсы валют (курс)
export const exch_rate = /(.*[к][ц|у][р][с].*|.*[к][к|у][р][с].*|.*[к][у][п|р][с].*|.*[к][у][о|р][с])|([в][в|а][л][ю][т].*|.*[в][п|а][л][ю][т].*|.*[в][а][о|л][ю][т].*|.*[в][а][д|л][ю][т].*)/gi
    // Адреса и отделения банка (адрес, отделение, отделения)
export const address = /(.*[а][д][р][е][с].*|.*[а][д][п|р][е][с].*|.*[а][д][о|р][е][с])|([о][т][л|д][е][л][е][н][и][я|е].*|.*.*[о][т][ж|д][е][л][е][н][и][я|е].*|.*[о][т][д][к|е][л][е][н][и][я|е].*|.*[о][т][д][н|е][л][е][н][и][я|е].*|.*[о][т][д][е][о|л][е][н][и][я|е].*|.*[о][т][д][е][д|л][е][н][и][я|е].*|.*[о][т][д][е][л][к|е][н][и][я|е].*|.*[о][т][д][е][л][н|е][н][и][я|е].*|.*[о][т][д][е][л][е][е|н][и][я|е].*|.*[о][т][д][е][л][е][г|н][и][я|е].*)/gi
    // Новости (новости, новость)
export const news = /.*[н][о][ы|в][о][с][т][ь|и].*|.*[н][о][а|в][о][с][т][ь|и].*|.*[н][о][в][р|о][с][т][ь|и].*|.*[н][о][в][л|о][с][т][ь|и].*|.*[н][о][в][о][ч|с][т][ь|и].*|.*[н][о][в][о][м|с][т][ь|и].*/gi
    // Чат с оператором (чат, оператор)
export const chat = /(.*[ч][в|а][т].*|.*[ч][п|а][т])|([о][п][н|е][р][а][т][о][р].*|.*[о][п][к|е][р][а][т][о][р].*|.*[о][п][е][п|р][а][т][о][р].*|.*[о][п][е][о|р][а][т][о][р].*|.*[о][п][е][р][в|а][т][о][р].*|.*[о][п][е][р][п|а][т][о][р].*|.*[о][п][е][р][а][и|т][о][р].*|.*[о][п][е][р][а][ь|т][о][р].*)/gi
    // Закинуть на телефон (телефон)
export const funds = /.*[т][е][о|л][е][ф][о][н].*|.*[т][е][д|л][е][ф][о][н].*|.*[т][е][л][к|е][ф][о][н].*|.*[т][е][л][н|е][ф][о][н].*|.*[т][е][л][е][ы|ф][о][н].*/gi
    // Перевод средств (перевод, перевести)
export const transfer = /(.*[п][е][п|р][е][в][о][д].*|.*[п][е][о|р][е][в][о][д].*|.*[п][е][р][к|е][в][о][д].*|.*[п][е][р][н|е][в][о][д].*|.*[п][е][р][е][ы|в][о][д].*|.*[п][е][р][е][а|в][о][д])|([п][е][п|р][е][в][е][с][т][и].*|.*[п][е][о|р][е][в][е][с][т][и].*|.*[п][е][р][к|е][в][е][с][т][и].*|.*[п][е][р][н|е][в][е][с][т][и].*|.*[п][е][р][е][ы|в][е][с][т][и].*|.*[п][е][р][е][а|в][е][с][т][и].*|.*[п][е][р][е][в][к|е][с][т][и].*|.*[п][е][р][е][в][н|е][с][т][и].*|.*[п][е][р][е][в][е][ч|с][т][и].*|.*[п][е][р][е][в][е][м|с][т][и].*)/gi

//Головной офис (головной, главный)
export const main_office = /.*[г][о][л][о][в][н][о][й].*|.*[г][л][а][в][н][ы][й].*/gi

// Оплата кредитов
export const credit_pay = /.*[о][п][л][а][т].*|.*[к][р][е][д][и][т].*/

// Банкомат
export const atm = /.*[б][а][н][к][о][м][а][т].*|.*[б][а][н][к][о][м][а][т][ы].*/gi

// Вклады
export const deposit_rx = /.*[в][к][л][а][д].*/gi

// Карты
export const card_rx = /.*[к][а][р][т][а|ы].*/gi

// Заблокировать карту
export const block_card_rx = /Заблокировать (\d{16}) .*/gi

// Кредиты
export const credit_rx = /.*[м][о][и|й].*[к][р][е][д][и][т].*/gi

// Оплата мобилки с карты по-умолчанию
export const pay_phone_rx = /Оплата (\d{11}) (\d+)/gi

//Приветствия
export const greetings_rx = /.*([д][о][б][р][о][е]) ? ([у][т][р][о]).*|.*([д][о][б][р][ы][й]) ? ([д][е][н][ь]).*|.*([д][о][б][р][ы][й]) ? ([в][е][ч][е][р]).*|.*([д][о][б][р][о][й]) ? ([н][о][ч][и]).*|.*([ч][т][о]) ? ([н][о][в][о][г][о]).*|.*[п][р][и][в][е][т].*|.*[з][д][о][р][о][в].*|.*[с][а][л][а][м].*|.*[с][а][л][ю][т].*|.*[з][д][р][а][в][с][т][в][у][й].*|.*[з][д][р][а][в][с][т][в][у][й][т][е].*|.*[н][а][м][а][с][т][е].*|.*[а][л][о][х][а].*|.*[ш][а][л][о][м].*/gi

//Как дела
export const wassup_rx = /.*([к][а][к]) ? ([д][е][л][а]).*|.*([к][а][к]) ? ([п][о][ж][и][в][а][е][ш][ь]).*|.*([к][а][к]) ? ([т][ы]).*|.*([к][а][к]) ? ([ж][и][з][н][ь]).*|.*([ч][е][м]) ? ([з][а][н][я][т]).*|.*([ч][т][о]) ? ([д][е][л][а][е][ш][ь]).*/gi

// Balance (remain, remainder)

export const currency_rx_en = /.*[b][a][l][a][n][c][e].*|.*[r][e][m][a][i][n].*|.*[r][e][m][a][i][n][d][e][r].*/gi
    // Exchange rate (exchange, rate, currency)
export const exch_rate_en = /(.*[e][x][c][h][a][n][g][e])|(.*[r][a][t][e])|([c][u][r][r][e][n][c][y].*)/gi
    // Addresses and bank branches (addresse, addresses, branche, branches, office, department)
export const address_en = /.*[a][d][d][r][e][s][s][e].*|.*[a][d][d][r][e][s][s][e][s].*|.*[b][r][a][n][c][h][e].*|.*[b][r][a][n][c][h][e][s].*|.*[o][f][f][i][c][e].*|.*[d][e][p][a][r][t][m][e][n][t].*/gi
    // News (news, event)
export const news_en = /.*[n][e][w][s].*|.*[e][v][e][n][t].*/gi
    // Chat with operator (chat, operator)
export const chat_en = /.*[c][h][a][t].*|.*[o][p][e][r][a][t][o][r].*/gi
    // Add funds (add, fund)
export const funds_en = /.*[a][d][d].*|.*[f][u][n][d].*/gi


// Money transfer (money, fund, transfer)
export const transfer_en = /.*[m][o][n][e][y].*|.*[f][u][n][d].*|.*[t][r][a][n][s][f][e][r].*/gi

//Head office
export const main_office_en = /.*[h][e][a][d].*/gi

// ATM
export const atm_en = /.*[a][t][m].*|.*[t][e][l][l][e][r].*/gi

// Depositst
export const deposit_en = /.*[d][e][p][o][s][i][t].*/gi

// Cards
export const card_en = /.*[c][а][r][d].*/gi

// Credits
export const credit_en = /.*[m][y].*[c][r][e][d][i][t].*/gi

//Greetings
export const greetings_rx_en = /.*[h][e][l][l][o].*|.*[h][i].*|.*[h][e][y].*|.*([g][o][o][d]) ? ([m][o][r][n][i][n][g]).*|.*([g][o][o][d]) ? ([d][a][y]).*|.*([g][o][o][d]) ? ([e][v][e][n][i][n][g]).*|.*([g][o][o][d]) ? ([n][i][g][h][t]).*|.*[s][a][l][u][t].*|.*([w][h][a][t][s]) ? ([u][p]).*[w][a][s][s][u][p].*|.*[a][l][o][h][a].*|.*[s][a][l][a][m].*|.*[s][h][a][l][o][m].*|.*[n][a][m][a][s][t][e].*/gi
